; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image3 - mode
	infrared0 - mode
	image1 - mode
	spectrograph2 - mode
	GroundStation3 - direction
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image3)
	(calibration_target instrument1 Star2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 103)
	(supports instrument3 image3)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(supports instrument5 image1)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 106)
	(supports instrument6 image1)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 spectrograph2)
	(supports instrument7 image1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 109)
	(= (data Planet4 image3) 36)
	(= (data Planet5 image3) 230)
	(= (data Planet6 image3) 71)
	(= (data Star7 image3) 107)
	(= (data Phenomenon8 image3) 200)
	(= (data Planet4 infrared0) 275)
	(= (data Planet5 infrared0) 93)
	(= (data Planet6 infrared0) 286)
	(= (data Star7 infrared0) 41)
	(= (data Phenomenon8 infrared0) 172)
	(= (data Planet4 image1) 290)
	(= (data Planet5 image1) 277)
	(= (data Planet6 image1) 300)
	(= (data Star7 image1) 187)
	(= (data Phenomenon8 image1) 178)
	(= (data Planet4 spectrograph2) 76)
	(= (data Planet5 spectrograph2) 233)
	(= (data Planet6 spectrograph2) 36)
	(= (data Star7 spectrograph2) 155)
	(= (data Phenomenon8 spectrograph2) 73)
	(= (slew_time GroundStation3 Star0) 2.898)
	(= (slew_time Star0 GroundStation3) 2.898)
	(= (slew_time GroundStation3 GroundStation1) 67.9)
	(= (slew_time GroundStation1 GroundStation3) 67.9)
	(= (slew_time GroundStation3 Star2) 1.37)
	(= (slew_time Star2 GroundStation3) 1.37)
	(= (slew_time Star2 Star0) 27.67)
	(= (slew_time Star0 Star2) 27.67)
	(= (slew_time Star2 GroundStation1) 40.04)
	(= (slew_time GroundStation1 Star2) 40.04)
	(= (slew_time GroundStation1 Star0) 38.64)
	(= (slew_time Star0 GroundStation1) 38.64)
	(= (slew_time Planet4 Star0) 76.29)
	(= (slew_time Star0 Planet4) 76.29)
	(= (slew_time Planet4 GroundStation1) 6.426)
	(= (slew_time GroundStation1 Planet4) 6.426)
	(= (slew_time Planet4 Star2) 1.861)
	(= (slew_time Star2 Planet4) 1.861)
	(= (slew_time Planet4 GroundStation3) 9.967)
	(= (slew_time GroundStation3 Planet4) 9.967)
	(= (slew_time Planet5 Star0) 67.31)
	(= (slew_time Star0 Planet5) 67.31)
	(= (slew_time Planet5 GroundStation1) 46.64)
	(= (slew_time GroundStation1 Planet5) 46.64)
	(= (slew_time Planet5 Star2) 56.5)
	(= (slew_time Star2 Planet5) 56.5)
	(= (slew_time Planet5 GroundStation3) 5.114)
	(= (slew_time GroundStation3 Planet5) 5.114)
	(= (slew_time Planet5 Planet4) 9.498)
	(= (slew_time Planet4 Planet5) 9.498)
	(= (slew_time Planet6 Star0) 9.124)
	(= (slew_time Star0 Planet6) 9.124)
	(= (slew_time Planet6 GroundStation1) 14.96)
	(= (slew_time GroundStation1 Planet6) 14.96)
	(= (slew_time Planet6 Star2) 86.33)
	(= (slew_time Star2 Planet6) 86.33)
	(= (slew_time Planet6 GroundStation3) 49.99)
	(= (slew_time GroundStation3 Planet6) 49.99)
	(= (slew_time Planet6 Planet4) 27.8)
	(= (slew_time Planet4 Planet6) 27.8)
	(= (slew_time Planet6 Planet5) 2.182)
	(= (slew_time Planet5 Planet6) 2.182)
	(= (slew_time Star7 Star0) 37.27)
	(= (slew_time Star0 Star7) 37.27)
	(= (slew_time Star7 GroundStation1) 40.07)
	(= (slew_time GroundStation1 Star7) 40.07)
	(= (slew_time Star7 Star2) 39.44)
	(= (slew_time Star2 Star7) 39.44)
	(= (slew_time Star7 GroundStation3) 30.1)
	(= (slew_time GroundStation3 Star7) 30.1)
	(= (slew_time Star7 Planet4) 6.938)
	(= (slew_time Planet4 Star7) 6.938)
	(= (slew_time Star7 Planet5) 68.43)
	(= (slew_time Planet5 Star7) 68.43)
	(= (slew_time Star7 Planet6) 34.35)
	(= (slew_time Planet6 Star7) 34.35)
	(= (slew_time Phenomenon8 Star0) 51.55)
	(= (slew_time Star0 Phenomenon8) 51.55)
	(= (slew_time Phenomenon8 GroundStation1) 11.41)
	(= (slew_time GroundStation1 Phenomenon8) 11.41)
	(= (slew_time Phenomenon8 Star2) 66.77)
	(= (slew_time Star2 Phenomenon8) 66.77)
	(= (slew_time Phenomenon8 GroundStation3) 71.08)
	(= (slew_time GroundStation3 Phenomenon8) 71.08)
	(= (slew_time Phenomenon8 Planet4) 84.17)
	(= (slew_time Planet4 Phenomenon8) 84.17)
	(= (slew_time Phenomenon8 Planet5) 19.71)
	(= (slew_time Planet5 Phenomenon8) 19.71)
	(= (slew_time Phenomenon8 Planet6) 60.84)
	(= (slew_time Planet6 Phenomenon8) 60.84)
	(= (slew_time Phenomenon8 Star7) 2.653)
	(= (slew_time Star7 Phenomenon8) 2.653)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet4 image3)
	(have_image Planet5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Phenomenon8 image3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 planet4 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 109 to 102.574, (fuel-used) from 0 to 6.426
   goals met: 0 of 5
2. (turn_to satellite2 groundstation3 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 102.574 to 92.607, (fuel-used) from 6.426 to 16.393
   goals met: 0 of 5
3. (turn_to satellite2 planet4 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 92.607 to 82.64, (fuel-used) from 16.393 to 26.36
   goals met: 0 of 5
4. (turn_to satellite2 star2 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 82.64 to 80.779, (fuel-used) from 26.36 to 28.221
   goals met: 0 of 5
5. (turn_to satellite2 planet4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 80.779 to 78.918, (fuel-used) from 28.221 to 30.082
   goals met: 0 of 5
6. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
7. (turn_to satellite2 groundstation3 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 78.918 to 68.951, (fuel-used) from 30.082 to 40.049
   goals met: 0 of 5
8. (turn_to satellite2 planet4 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 68.951 to 58.984, (fuel-used) from 40.049 to 50.016
   goals met: 0 of 5
9. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 0 of 5
10. (turn_to satellite2 star2 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 58.984 to 57.123, (fuel-used) from 50.016 to 51.877
   goals met: 0 of 5
11. (turn_to satellite2 planet4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 57.123 to 55.262, (fuel-used) from 51.877 to 53.738
   goals met: 0 of 5
12. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
13. (turn_to satellite2 star2 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 55.262 to 53.401, (fuel-used) from 53.738 to 55.599
   goals met: 0 of 5
14. (turn_to satellite2 planet4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 53.401 to 51.54, (fuel-used) from 55.599 to 57.46
   goals met: 0 of 5
15. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 0 of 5
16. (turn_to satellite2 star2 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 51.54 to 49.679, (fuel-used) from 57.46 to 59.321
   goals met: 0 of 5
17. (turn_to satellite2 planet4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 49.679 to 47.818, (fuel-used) from 59.321 to 61.182
   goals met: 0 of 5
18. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
19. (turn_to satellite2 star2 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 47.818 to 45.957, (fuel-used) from 61.182 to 63.043
   goals met: 0 of 5
20. (turn_to satellite2 planet4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 45.957 to 44.096, (fuel-used) from 63.043 to 64.904
   goals met: 0 of 5
21. (turn_to satellite2 groundstation3 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 44.096 to 34.129, (fuel-used) from 64.904 to 74.871
   goals met: 0 of 5
22. (turn_to satellite2 planet4 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 34.129 to 24.162, (fuel-used) from 74.871 to 84.838
   goals met: 0 of 5
23. (turn_to satellite2 star2 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 24.162 to 22.301, (fuel-used) from 84.838 to 86.699
   goals met: 0 of 5
24. (turn_to satellite2 planet4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 22.301 to 20.44, (fuel-used) from 86.699 to 88.56
   goals met: 0 of 5
25. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 0 of 5
26. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 5
27. (turn_to satellite2 groundstation1 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 20.44 to 14.014, (fuel-used) from 88.56 to 94.986
   goals met: 0 of 5
28. (calibrate satellite2 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 5
29. (switch_off instrument7 satellite2)
   deleted: (power_on instrument7)
   added: (power_avail satellite2)
   goals met: 0 of 5
30. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
31. (calibrate satellite2 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 5
32. (turn_to satellite2 planet4 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 14.014 to 7.588, (fuel-used) from 94.986 to 101.412
   goals met: 0 of 5
33. (take_image satellite2 planet4 instrument6 image3)
   added: (have_image planet4 image3)
   changed: (data_capacity satellite2) from 1000 to 964, (data-stored) from 0 to 36
   goals met: 1 of 5
34. (turn_to satellite2 star7 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 7.588 to 0.65, (fuel-used) from 101.412 to 108.35
   goals met: 1 of 5
35. (turn_to satellite1 planet5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 106 to 86.29, (fuel-used) from 108.35 to 128.06
   goals met: 1 of 5
36. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 1 of 5
37. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
38. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 103 to 91.59, (fuel-used) from 128.06 to 139.47
   goals met: 1 of 5
39. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 5
40. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 91.59 to 80.18, (fuel-used) from 139.47 to 150.88
   goals met: 1 of 5
41. (take_image satellite0 phenomenon8 instrument0 image3)
   added: (have_image phenomenon8 image3)
   changed: (data_capacity satellite0) from 1000 to 800, (data-stored) from 36 to 236
   goals met: 2 of 5
42. (turn_to satellite1 planet6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 86.29 to 84.108, (fuel-used) from 150.88 to 153.062
   goals met: 2 of 5
43. (turn_to satellite1 planet5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 84.108 to 81.926, (fuel-used) from 153.062 to 155.244
   goals met: 2 of 5
44. (turn_to satellite1 groundstation3 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 81.926 to 76.812, (fuel-used) from 155.244 to 160.358
   goals met: 2 of 5
45. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 2 of 5
46. (turn_to satellite1 star0 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 76.812 to 73.914, (fuel-used) from 160.358 to 163.256
   goals met: 2 of 5
47. (calibrate satellite1 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 2 of 5
48. (turn_to satellite1 groundstation3 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 73.914 to 71.016, (fuel-used) from 163.256 to 166.154
   goals met: 2 of 5
49. (turn_to satellite1 planet5 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 71.016 to 65.902, (fuel-used) from 166.154 to 171.268
   goals met: 2 of 5
50. (turn_to satellite1 planet6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 65.902 to 63.72, (fuel-used) from 171.268 to 173.45
   goals met: 2 of 5
51. (turn_to satellite1 planet5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 63.72 to 61.538, (fuel-used) from 173.45 to 175.632
   goals met: 2 of 5
52. (turn_to satellite1 planet6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 61.538 to 59.356, (fuel-used) from 175.632 to 177.814
   goals met: 2 of 5
53. (turn_to satellite1 planet5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 59.356 to 57.174, (fuel-used) from 177.814 to 179.996
   goals met: 2 of 5
54. (turn_to satellite1 planet6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 57.174 to 54.992, (fuel-used) from 179.996 to 182.178
   goals met: 2 of 5
55. (take_image satellite1 planet6 instrument5 spectrograph2)
   added: (have_image planet6 spectrograph2)
   changed: (data_capacity satellite1) from 1000 to 964, (data-stored) from 236 to 272
   goals met: 3 of 5
56. (turn_to satellite1 planet5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 54.992 to 52.81, (fuel-used) from 182.178 to 184.36
   goals met: 3 of 5
57. (take_image satellite1 planet5 instrument5 spectrograph2)
   added: (have_image planet5 spectrograph2)
   changed: (data_capacity satellite1) from 964 to 731, (data-stored) from 272 to 505
   goals met: 4 of 5
58. (switch_on instrument7 satellite2)
   deleted: (calibrated instrument7) (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 4 of 5
59. (turn_to satellite1 planet4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 52.81 to 43.312, (fuel-used) from 184.36 to 193.858
   goals met: 4 of 5
60. (turn_to satellite1 star7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 43.312 to 36.374, (fuel-used) from 193.858 to 200.796
   goals met: 4 of 5
61. (take_image satellite1 star7 instrument5 spectrograph2)
   added: (have_image star7 spectrograph2)
   changed: (data_capacity satellite1) from 731 to 576, (data-stored) from 505 to 660
   goals met: 5 of 5
